{
    "title": "Introduction to Microsoft Excel",
    "star": "4.6",
    "unit": "Coursera Project Network",
    "total reviews": "Recommended experience",
    "level": "Intermediate level",
    "reviews": [
        {
            "Starts": 1,
            "Reviewer": "By Kaitlin O",
            "Date": "Dec 14, 2021",
            "Content": "if you have ANY knowledge of excel, don't waste your time with this. i could have figured this stuff out by opening an excel doc. you will learn how to bold/underline a header and sum a column of data. if you want more in depth knowledge of excel, try a different course."
        },
        {
            "Starts": 1,
            "Reviewer": "By Malu C",
            "Date": "Aug 5, 2022",
            "Content": "An excellent and easy to understand course for those who need to use excel for work or school but have no idea of how to get started. This course will guide you with all the basics"
        },
        {
            "Starts": 1,
            "Reviewer": "By Kevin A",
            "Date": "Jan 18, 2023",
            "Content": "A little less content than expected but the title does say it's just an intro plus it's free. The explanations are clear and the course is quite engaging.  The Coursera platform is very user-friendly."
        },
        {
            "Starts": 1,
            "Reviewer": "By Aron A S",
            "Date": "Apr 13, 2022",
            "Content": "this is best for begginner guided course in excel which will help him/her the power of excel"
        },
        {
            "Starts": 1,
            "Reviewer": "By AYSHA S",
            "Date": "Feb 9, 2024",
            "Content": "After completing the course, I was hoping to have a deeper understanding of the subject matter. However, I found that the course only touched on the surface-level concepts and lacked in-depth analysis. The course content was quite basic and did not provide any new insights or knowledge that I was not already aware of. Overall, I was disappointed with the course and felt that it did not meet my expectations. I had expected the course to be more detailed, but unfortunately, I didn't gain much knowledge. The material covered in this course is quite basic."
        },
        {
            "Starts": 1,
            "Reviewer": "By Ayesha N",
            "Date": "Feb 17, 2024",
            "Content": "Complete waste of time for someone who knows the VERY BASICS of excel. if you have never even heard of excel before then this is for you, but even then there would be better ways to learn the basics"
        },
        {
            "Starts": 1,
            "Reviewer": "By HARSH A",
            "Date": "Mar 25, 2022",
            "Content": "This guided project is very practical and way better than theoretical learning."
        },
        {
            "Starts": 1,
            "Reviewer": "By jess m",
            "Date": "Jul 18, 2022",
            "Content": "VERY basic intro to Excel. Great clear instructions and easy to do."
        },
        {
            "Starts": 1,
            "Reviewer": "By Zyrus A",
            "Date": "Jul 8, 2022",
            "Content": "Ever since I started working in our office a month ago, Microsoft Excel was one of the most software apps that I am frequently using whenever I'm doing report—so I took this course to freshen my skills on it once again, and it helped me a lot.  A huge thanks to our kind Professor, Ms. Summer Scaggs for being a good instructor and delivering the lesson very well during the entire online class.  "
        },
        {
            "Starts": 1,
            "Reviewer": "By Annalisa G",
            "Date": "Apr 5, 2022",
            "Content": "One question in the quiz is confusing.  It says to \"create a worksheet in Excel that shows the number of states for each sales person.  What would you put as the header for column A and column B (in that order)\"  The order of the information provided says \"number of states for each sales person\" which would be option 4, \"No. of States, Salesperson\".  The other interpretation would be option 1, \"Salesperson, No. Of States\".  This question just needs to be more clear so it's not open to interpretation, leading to answering the question incorrectly."
        },
        {
            "Starts": 1,
            "Reviewer": "By Satyam S",
            "Date": "Nov 12, 2022",
            "Content": "It is a Good free resource for learning. Use it.Event though the content in this course is not to advance but it is always better to have a little understanding of a topic rather than having none.If you are reading this review before attempting it I would like to tell you that this is a pretty basic course you can do it if you don't have any idea of what is excel and how to use it. And it won't take much time. In fact you can clear this course within 1.5 hours if you want to."
        },
        {
            "Starts": 1,
            "Reviewer": "By Awais A",
            "Date": "Feb 27, 2023",
            "Content": "This platform is very helpful for learning skills.I am very satisfied to this platform. If you are looking for a skill you should have to attention on your skillslearning through this platform"
        },
        {
            "Starts": 1,
            "Reviewer": "By Gunjan G",
            "Date": "Aug 14, 2023",
            "Content": "Certificate doesn't contain my name on it. also the completion date is wrong on the certificate. this makes it useless for me to do this course"
        },
        {
            "Starts": 1,
            "Reviewer": "By Pam F",
            "Date": "Jul 28, 2022",
            "Content": "Was hard to navigate and really didn't learn anything to help me with Excel. "
        },
        {
            "Starts": 1,
            "Reviewer": "By tita m",
            "Date": "Dec 6, 2023",
            "Content": "Introduction to Microsoft Excel course is an excellent starting point for anyone looking to master spreadsheet skills. The course provides a clear and comprehensive overview of Excel’s functionalities, making it accessible for beginners. The instructor breaks down complex concepts into manageable segments, making it easy to follow along and understand."
        },
        {
            "Starts": 1,
            "Reviewer": "By Fajar S",
            "Date": "Jan 12, 2024",
            "Content": "Recommended for kids around elementary school who just started to gain hands-on experience using cloud based productivity applications such as Microsoft 365 family.\nAlso apply to mature people who just switching from old fashioned desktop oriented office productivity suit into cloud based modern office productivity suits."
        },
        {
            "Starts": 1,
            "Reviewer": "By Alexander A",
            "Date": "Jan 13, 2023",
            "Content": "A very short course that can be finished withing an hour but only goes over very basic functions and layout of excel. for me it was a great starting point to lunch me into more content for excel "
        },
        {
            "Starts": 1,
            "Reviewer": "By WAQAS A",
            "Date": "Jun 26, 2022",
            "Content": "such a tremendous guided project it looks difficult to start it  but when you start it the instructure makes it very easy i will recommend it at all every where."
        },
        {
            "Starts": 1,
            "Reviewer": "By Jiayu F",
            "Date": "Aug 6, 2022",
            "Content": "Nice video and useful project. Even though the knowledge is pretty entry-level, but it really teaches me some useful shortcuts in Excel"
        },
        {
            "Starts": 1,
            "Reviewer": "By Brandy B",
            "Date": "May 28, 2022",
            "Content": "Great introduction class and easy for anyone to understand. "
        },
        {
            "Starts": 1,
            "Reviewer": "By Indigo R",
            "Date": "May 17, 2024",
            "Content": "difficult to understand instructor, the audio is high-pitched and grating, the video is too small to see properly to work side-by-side in the lab, lab is difficult to use as described by the instructor. Looking for another education source "
        },
        {
            "Starts": 1,
            "Reviewer": "By Esteban G J",
            "Date": "May 1, 2024",
            "Content": "The instructor was not aware of the formulas that Excel has to offer. Instead of inserting \"=Sum(x:y), the instructor just wrote \"= \" and individually selected each cell to followed by a plus sign after each cell. "
        },
        {
            "Starts": 1,
            "Reviewer": "By Devon W",
            "Date": "May 5, 2023",
            "Content": "Not Necessary to look at all only 6 mins worth of information that isnt even information thats new to even a beginner it simply explains why microsoft excel was created which is obvious"
        },
        {
            "Starts": 1,
            "Reviewer": "By Humberto",
            "Date": "May 26, 2024",
            "Content": "Muy mala orientación puesto que busque cursos en español y me sugirieron este, luego de hacer los paso para inscribirme y comenzar me entero que es todo en ingles, gracias, saludos\n"
        },
        {
            "Starts": 1,
            "Reviewer": "By Martha S",
            "Date": "Dec 2, 2023",
            "Content": "there is nothing to learn from or watch. I wanted real videos on how to create real spreadsheets and understand the formulas and pivot tables not just some basic stuff"
        }
    ]
}